Apps/Artillery/docker-compose.yml
name: artillery-stress-tester

services:
  artillery:
    image: artilleryio/artillery:2.0.5
    user: $PUID:$PGID
    environment:
      PUID: $PUID
      PGID: $PGID
      TZ: $TZ
    volumes:
      - /DATA/AppData/$AppID/tests:/tests
      - /DATA/AppData/$AppID/reports:/reports
    working_dir: /tests
    restart: unless-stopped
    command: tail -f /dev/null
    deploy:
      resources:
        limits:
          memory: 256M
          cpus: '0.3'

  nginx:
    image: nginx:1.25.3-alpine
    environment:
      PUID: $PUID
      PGID: $PGID
      TZ: $TZ
    volumes:
      - /DATA/AppData/$AppID/html:/usr/share/nginx/html
    expose:
      - 80
    restart: unless-stopped
    deploy:
      resources:
        limits:
          memory: 64M
          cpus: '0.1'

x-casaos:
  architectures:
    - amd64
    - arm64
    - arm/v7
  main: nginx
  author: Yundera Community
  category: Utilities
  description:
    en_us: |
      Artillery - Simple YAML-based stress testing tool with beautiful HTML reports. 
      No complex setup required! Just edit simple YAML files and run tests. 
      Perfect for beginners who want professional load testing without coding.
      
      Features: YAML configuration, HTML reports, WebSocket support, CI/CD ready.
    ko_kr: |
      Artillery - 아름다운 HTML 리포트를 제공하는 간단한 YAML 기반 스트레스 테스트 도구입니다.
      복잡한 설정이 필요 없습니다! 간단한 YAML 파일만 편집하고 테스트를 실행하세요.
      코딩 없이 전문적인 로드 테스트를 원하는 초보자에게 완벽합니다.
    fr_fr: |
      Artillery - Outil de test de stress basé sur YAML avec de beaux rapports HTML.
      Aucune configuration complexe requise!
    es_es: |
      Artillery - Herramienta de prueba de estrés basada en YAML con hermosos informes HTML.
      ¡No se requiere configuración compleja!
    zh_cn: |
      Artillery - 基于YAML的简单压力测试工具，生成精美的HTML报告。无需复杂设置！
  developer: Artillery.io
  icon: https://cdn.jsdelivr.net/gh/Yundera/AppStore@main/Apps/ArtilleryStressTester/icon.png
  screenshot: https://cdn.jsdelivr.net/gh/Yundera/AppStore@main/Apps/ArtilleryStressTester/screenshot-1.png
  tagline:
    en_us: "Simple YAML stress testing - beautiful HTML reports!"
    ko_kr: "간단한 YAML 스트레스 테스트 - 아름다운 HTML 리포트!"
    fr_fr: "Tests de stress YAML simples - beaux rapports HTML!"
    es_es: "Pruebas de estrés YAML simples - ¡hermosos informes HTML!"
    zh_cn: "简单的YAML压力测试 - 精美的HTML报告！"
  title:
    en_us: Artillery
    ko_kr: Artillery
    fr_fr: Artillery
    es_es: Artillery
    zh_cn: Artillery
  tips:
    before_install:
      en_us: |
        **Artillery Stress Tester**
        
        **How to Use:**
        1. Access: https://artillery-stress-tester-username.nsl.sh/
        2. Click "Edit Test" to modify YAML configuration
        3. Click "Run Test" to start stress testing
        4. View beautiful HTML reports
        
        **Simple YAML Example:**
        ```yaml
        config:
          target: https://httpbin.org
          phases:
            - duration: 60
              arrivalRate: 10
        scenarios:
          - name: "Basic test"
            requests:
              - get:
                  url: "/"
        ```
        
        **Features:**
        - No coding required - just YAML
        - Beautiful HTML reports
        - Real-time stats
        - WebSocket support
        - CI/CD ready
        
        Super simple setup!
      ko_kr: |
        **Artillery 스트레스 테스터**
        
        **사용 방법:**
        1. 접속: https://artillery-stress-tester-username.nsl.sh/
        2. "Edit Test" 클릭하여 YAML 설정 수정
        3. "Run Test" 클릭하여 스트레스 테스트 시작
        4. 아름다운 HTML 리포트 확인
        
        **간단한 YAML 예제:**
        ```yaml
        config:
          target: https://httpbin.org
          phases:
            - duration: 60
              arrivalRate: 10
        scenarios:
          - name: "기본 테스트"
            requests:
              - get:
                  url: "/"
        ```
        
        **기능:**
        - 코딩 불필요 - YAML만 사용
        - 아름다운 HTML 리포트
        - 실시간 통계
        - WebSocket 지원
        - CI/CD 준비됨
        
        매우 간단한 설정!
  index: /
  webui_port: 80